const services = [
  {
    icon: "🔍",
    title: "SEO",
    desc: "บริการปรับแต่งเว็บไซต์ให้มีประสิทธิภาพ เพื่อให้ติดอันดับการค้นหาบน Google ด้วยเทคนิค SEO ช่วยเพิ่มคุณค่าให้เว็บไซต์และยอดขายของคุณในระยะยาว พร้อมให้คำแนะนำด้านการเลือกใช้คีย์เวิร์ด (Keyword) อย่างเหมาะสม เพื่อให้เว็บไซต์ของคุณแสดงผลในลำดับที่ดีที่สุดและค้นหาเจอง่ายที่สุด"
  },
  {
    icon: "🎬",
    title: "Video Production",
    desc: "บริการผลิตภาพนิ่ง และ VDO Content เต็มรูปแบบโดยทีมงานมืออาชีพ ตั้งแต่เริ่มต้นจนจบครบทุกกระบวนการ Create ผลงานหลากหลายแนว หลากหลายสไตล์ เพื่อให้ผลงาน และบริการของคุณเข้าถึงกลุ่มเป้าหมายได้อย่างชัดเจน และสื่อสารเรื่องราวสู่อินไซต์ที่แท้จริงของจุด"
  },
  {
    icon: "🤝",
    title: "Influencer Marketing",
    desc: "บริการวางกลยุทธ์ ออกแบบแผนการตลาดผ่าน KOL, Influencer รวมถึงทำรีวิว พร้อมคัดสรรอินฟลูเอนเซอร์ที่เหมาะสมกับแบรนด์ของคุณ ช่วยให้เข้าถึงความสนใจของกลุ่มเป้าหมายที่ตรงกลุ่มมากขึ้น บริการช่วยขยายช่องทางออนไลน์ เพิ่มการรับรู้ และสร้างความน่าเชื่อถือให้กับแบรนด์"
  },
  {
    icon: "🌱",
    title: "Seeding Marketing",
    desc: "บริการ Seeding Marketing ที่ช่วยสร้างการรับรู้ และกระตุ้นความสนใจสินค้า หรือบริการของคุณผ่านการปลูกข่าวเชิงบวกบนแพลตฟอร์มต่าง ๆ เราจะช่วยทำให้แบรนด์ของคุณเป็นที่พูดถึง พร้อมสร้างความน่าเชื่อถือให้กับผู้บริโภค ด้วยการวางจังหวะที่ตรงใจ และเนื้อหาที่อ่านเป็นธรรมชาติ"
  },
  {
    icon: "💻",
    title: "Website",
    desc: "บริการปรับแต่งเว็บไซต์ให้ตอบโจทย์กับธุรกิจคุณ ด้วยมาตรฐานระดับประสบการณ์การใช้งานของ User ให้สะดวก และน่าสนใจต่อผู้ชม พร้อมปรับโครงสร้างเว็บไซต์ให้มีประสิทธิภาพ ตรงตาม SEO ของ Google เพิ่มปริมาณ Traffic และสร้างโอกาสในการขยายยอดขายให้ธุรกิจของคุณอย่างยั่งยืน"
  },
  {
    icon: "🧑‍💼",
    title: "Consult",
    desc: "บริการที่ปรึกษาการตลาด (Consulting) ที่ช่วยวางแผน และพัฒนา Marketing Strategy ที่เหมาะสมกับธุรกิจของคุณ เรามุ่งเน้นการสร้างกลยุทธ์การตลาดที่มีประสิทธิภาพ เพื่อเพิ่มโอกาสสู่เป้าหมายทางธุรกิจ และผลลัพธ์ที่ดีในระยะยาว ช่วยให้ธุรกิจของคุณเติบโตอย่างยั่งยืน"
  }
]

function Services() {
  return (
    <section id="services" className="services">
      <div className="section-content">
        <h2>บริการของเรา</h2>
        <div className="services-grid">
          {services.map((item, idx) => (
            <div className="service-box" key={idx}>
              <div className="service-title">
                <span className="service-icon">{item.icon}</span>
                <h3>{item.title}</h3>
              </div>
              <p>{item.desc}</p>
            </div>
          ))}
        </div>
      </div>
      {/* <div className="section-image">
        <img src="https://pdmarketinginnovate.com/wp-content/uploads/2022/10/s__14139398.jpg?strip=info&w=800"
          alt="บริการ" />
      </div> */}
    </section>
  )
}
export default Services